学习课件/jmeter.log
2025-12-19 16:14:25,500 INFO o.a.j.u.JMeterUtils: Setting Locale to zh_CN
2025-12-19 16:14:25,528 INFO o.a.j.JMeter: Loading user properties from: D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\user.properties
2025-12-19 16:14:25,528 INFO o.a.j.JMeter: Loading system properties from: D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\system.properties
2025-12-19 16:14:25,536 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-12-19 16:14:25,536 INFO o.a.j.JMeter: Version 5.6.3
2025-12-19 16:14:25,537 INFO o.a.j.JMeter: java.version=17.0.6
2025-12-19 16:14:25,537 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-12-19 16:14:25,537 INFO o.a.j.JMeter: os.name=Windows 10
2025-12-19 16:14:25,537 INFO o.a.j.JMeter: os.arch=amd64
2025-12-19 16:14:25,537 INFO o.a.j.JMeter: os.version=10.0
2025-12-19 16:14:25,537 INFO o.a.j.JMeter: file.encoding=GBK
2025-12-19 16:14:25,537 INFO o.a.j.JMeter: java.awt.headless=true
2025-12-19 16:14:25,537 INFO o.a.j.JMeter: Max memory     =1073741824
2025-12-19 16:14:25,537 INFO o.a.j.JMeter: Available Processors =8
2025-12-19 16:14:25,546 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-12-19 16:14:25,547 INFO o.a.j.JMeter: JMeter  Locale=Chinese (China)
2025-12-19 16:14:25,547 INFO o.a.j.JMeter: JMeterHome=D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3
2025-12-19 16:14:25,547 INFO o.a.j.JMeter: user.dir  =D:\测试资料\性能监控环境搭建\学习课件
2025-12-19 16:14:25,547 INFO o.a.j.JMeter: PWD       =D:\测试资料\性能监控环境搭建\学习课件
2025-12-19 16:14:25,549 INFO o.a.j.JMeter: IP: 192.168.10.123 Name: win10-0024 FullName: win10-0024
2025-12-19 16:14:25,566 INFO o.a.j.s.FileServer: Default base='D:\测试资料\性能监控环境搭建\学习课件'
2025-12-19 16:14:25,568 INFO o.a.j.s.FileServer: Set new base='D:\测试资料\性能监控环境搭建\学习课件'
2025-12-19 16:14:25,758 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-12-19 16:14:25,904 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-12-19 16:14:25,908 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-12-19 16:14:25,911 INFO o.a.j.s.SaveService: Loading file: 混合场景设计.jmx
2025-12-19 16:14:26,010 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-19 16:14:26,011 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-19 16:14:26,011 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-19 16:14:26,011 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-19 16:14:26,011 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-12-19 16:14:26,011 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-12-19 16:14:26,021 INFO o.a.j.JMeter: Creating summariser <summary>
2025-12-19 16:14:26,034 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-12-19 16:14:26,035 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-19 16:14:26,035 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-19 16:14:26,040 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-12-19 16:14:26,040 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-12-19 16:14:26,108 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-fifo-0.2.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,114 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-casutg-3.1.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,127 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\mysql-connector-java-8.0.15.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,300 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-graphs-additional-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,305 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-graphs-basic-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,307 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\json-20080701.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,312 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.11.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,420 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-tst-2.6.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,423 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-functions-2.2.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,429 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-ffw-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,431 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-filterresults-2.2.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,434 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-dummy-0.4.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,438 INFO o.a.j.r.ClassFinder: Will scan jar D:\测试软件\jmeter\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-perfmon-2.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-19 16:14:26,676 INFO o.a.j.JMeter: 正在运行的测试 (1766132066675)
2025-12-19 16:14:26,678 INFO o.a.j.e.StandardJMeterEngine: Starting setUp thread groups
2025-12-19 16:14:26,678 INFO o.a.j.e.StandardJMeterEngine: Starting setUp ThreadGroup: 1 : setUp 线程组 
2025-12-19 16:14:26,678 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group setUp 线程组.
2025-12-19 16:14:26,678 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-12-19 16:14:26,678 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2025-12-19 16:14:26,682 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-12-19 16:14:26,682 INFO o.a.j.e.StandardJMeterEngine: Waiting for all setup thread groups to exit
2025-12-19 16:14:26,684 INFO o.a.j.t.JMeterThread: Thread started: setUp 线程组 1-1
2025-12-19 16:14:27,525 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：test520,480586
2025-12-19 16:14:27,541 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = win10-0024
2025-12-19 16:14:27,551 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-12-19 16:14:27,553 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-12-19 16:14:27,553 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-12-19 16:14:27,553 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-12-19 16:14:27,553 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-12-19 16:14:27,644 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2025-12-19 16:14:27,650 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2025-12-19 16:14:27,650 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2025-12-19 16:14:27,732 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2025-12-19 16:14:27,736 INFO o.a.j.u.SSLManager: KeyStore created OK
2025-12-19 16:14:27,736 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2025-12-19 16:14:28,203 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,206 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：admin987,389263
2025-12-19 16:14:28,253 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,254 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：user881,374247
2025-12-19 16:14:28,293 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,294 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：user375,445656
2025-12-19 16:14:28,336 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,337 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：test387,337926
2025-12-19 16:14:28,377 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,378 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：test910,855358
2025-12-19 16:14:28,420 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,421 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：test168,312163
2025-12-19 16:14:28,463 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,465 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：admin710,948489
2025-12-19 16:14:28,507 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,508 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：user201,896297
2025-12-19 16:14:28,549 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,550 INFO o.a.j.m.J.JSR223 预处理程序: ? 已生成用户：user762,1056961
2025-12-19 16:14:28,590 INFO o.a.j.e.J.JSR223 后置处理程序: ? 成功生成账号文件: D:/测试资料/性能监控环境搭建/学习课件/test_data.csv
2025-12-19 16:14:28,590 INFO o.a.j.t.JMeterThread: Thread is done: setUp 线程组 1-1
2025-12-19 16:14:28,590 INFO o.a.j.t.JMeterThread: Thread finished: setUp 线程组 1-1
2025-12-19 16:14:28,593 INFO o.a.j.e.StandardJMeterEngine: All Setup Threads have ended
2025-12-19 16:14:28,613 INFO o.a.j.e.StandardJMeterEngine: No enabled thread groups found
2025-12-19 16:14:28,613 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-12-19 16:14:28,617 INFO o.a.j.r.Summariser: summary =     10 in 00:00:02 =    5.2/s Avg:    82 Min:    37 Max:   474 Err:     0 (0.00%)